Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/social_welfare/irish_social_welfare_system/social_insurance_prsi/class_S_prsi.html.txt.tmx
Source language: en
Languages: ga

source: Pay Related Social Insurance (PRSI) contributions are deducted from your income and used to fund social insurance payments, for example, State pensions
ga: Asbhaintear ranníocaíochtaí Árachais Shóisialta Phá-Coibhneasa (ÁSPC) as d’ioncam agus úsáidtear iad le híocaíochtaí árachais shóisialta a mhaoiniú, mar shampla, pinsin Stáit

source: There are different rates of PRSI for different categories. Most employees pay Class A PRSI
ga: Is ann do rátaí difriúla ÁSPC le haghaidh catagóirí difriúla

source: If you are self-employed, you pay Class S PRSI
ga: Íocann an chuid is mó d’fhostaithe ÁSPC Aicme A

source: PRSI for self-employed people was introduced in 1988
ga: Má tá tú féinfhostaithe, íocann tú ÁSPC ag Aicme S

source: People who pay Class S include farmers, professional people, certain company directors, people in business on their own or in partnerships and people with income from investments, rents or maintenance payments
ga: Ar na daoine a íocann Aicme S tá feirmeoirí, daoine gairmiúla, stiúrthóirí áirithe cuideachtaí, daoine i ngnó nó leo féin nó i gcomhpháirtíochtaí agus daoine ag a bhfuil ioncam ó infheistíochtaí, ó chíosanna nó ó íocaíochtaí cothabhála

source: Employees who are also self-employed in a trade or profession pay Class S PRSI on that income as well as their Class A PRSI contribution as an employee
ga: Íocann fostaithe atá féinfhostaithe i gceird nó i ngairm ÁSPC Aicme S ar an ioncam sin mar aon lena gcuid ranníocaíochtaí ÁSPC Aicme A mar fhostaí

source: Class S contributions only cover you for a limited number of payments
ga: Ní fhéadann ranníocaíochtaí Aicme S tú a chlúdach ach le haghaidh líon teoranta íocaíochtaí

source: In general they do not cover you for any short-term payments including illness and disability payments
ga: Go ginearálta, ní chlúdaíonn siad thú le haghaidh aon íocaíochtaí gearrthéarmacha lena n-áirítear íocaíochtaí tinnis agus míchumais

source: They do not cover you for Jobseeker's Benefit
ga: Ní chlúdaíonn siad thú le haghaidh Sochar Cuardaitheora Poist

source: If you satisfy all the other conditions, Class S contributions can entitle you to:
ga: Má chomhlíonann tú na coinníollacha go léir eile, is féidir go dtugann ranníocaíochtaí Aicme S an ceart agat chun na nithe seo:

source: • Widow's, Widower's or Surviving Civil Partner's (Contributory) Pension
ga: • Pinsean Baintrí, Baintrí Fir nó Páirtnéara Shibhialta Mharthanaigh (Ranníocach)

source: Note that you cannot claim your State Pension (Contributory) until all outstanding payments have been made
ga: Tabhair faoi deara nach bhféadfaidh tú do Phinsean Stáit (Ranníocach) a éileamh go dtí go ndéantar gach íocaíocht gan íoc

source: If you are aged over 66 and still owe Class S PRSI contributions, your State Pension (Contributory) will only be paid from the date that you have paid all outstanding contributions and any outstanding income taxes in full
ga: Más rud é go bhfuil tú níos sine ná 66 bliain d’aois agus go bhfuil ranníocaíochtaí ÁSPC Aicme S ort go fóill, ní íocfar do Phinsean Stáit (Ranníocach) ach ón dáta ar ar íoc tú na ranníocaíochtaí gan íoc ar fad agus aon chánacha ioncaim gan íoc go hiomlán

source: The Department of Social Protection has published a leaflet PRSI for the Self-Employed - SW74
ga: D’fhoilsigh an Roinn Coimirce Sóisialaí bileog faisnéise ÁSPC do Dhaoine Féinfhostaithe - SW74

source: If you are aged between 16 and 66 you pay Class S PRSI of 4% on all your income for tax purposes, that is, gross income less allowable expenses
ga: Má tá tú idir 16 bliana d’aois agus 66 bliain d’aois, íocann tú ÁSPC Aicme S de 4% ar d'ioncam uile ar mhaithe le cuspóirí cánach, is é sin, ollioncam lúide costais inlámhála

source: You must pay 4% of all your income or €500, whichever is greater
ga: Ní mór duit 4% de d’ioncam uile a íoc, nó €500, pé ceann is mó

source: If you earn less than €5,000 from self-employment in a year you are exempt from PRSI, but you may pay €500 as a voluntary contributor (if you meet the other conditions)
ga: Má thuilleann tú níos lú ná €5,000 ó fhéinfhostaíocht i mbliain, beidh tú díolmhaithe ó ÁSPC a íoc, ach féadfaidh tú €500 a íoc mar rannpháirtí deonach (má chomhlíonann tú coinníollacha eile)

source: You can read about employing family members in our document on social insurance
ga: Is féidir leat faisnéise a léamh faoi dhaoine muinteartha a fhostú inár ndoiciméad ar árachas sóisialta

source: If you are self-employed, you pay Class S social insurance contributions directly to Revenue, when you send in your tax returns for the year
ga: Má tá tú féinfhostaithe, íocann tú ranníocaíochtaí árachais shóisialta Aicme S go díreach leis na Coimisinéirí Ioncaim nuair a sheolann tú isteach do thuairisceán cánach don bhliain

source: Revenue then pays the money into the Social Insurance Fund and sends a record of the contributions you have paid to the Department of Social Protection
ga: Íocann na Coimisinéirí Ioncaim an t-airgead isteach sa Chiste Árachais Shóisialta agus seolann siad taifead ar na ranníocaíochtaí a d’íoc tú leis an Roinn Coimirce Sóisialaí

source: You can request a copy of your social insurance record online
ga: Is féidir leat cóip de do thaifead árachais shóisialta a iarraidh ar líne

source: To check your social insurance record, you will need your Personal Public Service Number (PPSN)
ga: Chun do thaifead árachais shóisialta a sheiceáil, beidh d’Uimhir Phearsanta Seirbhíse Poiblí (UPSP) ag teastáil uait

source: Note that you pay Class S contributions in an annual payment for your full tax year
ga: Tabhair faoi deara go n-íocann tú ranníocaíochtaí Aicme S in íocaíocht bhliantúil le haghaidh do bhliana cánach iomláine

source: There is no mechanism for awarding credits for a full year or part of a year
ga: Ní ann d’aon mheicníocht le sochair a bhronnadh do bhliain iomlán nó do chuid de bhliain

source: When you take up self-employment you should inform Revenue that you are now self-employed and you wish to register for self-assessment
ga: Ba cheart duit na Coimisinéirí Ioncaim a chur ar an eolas go bhfuil tú féinfhostaithe anois agus gur mian leat clárú le haghaidh féinmheasúnú tar éis duit tabhairt faoi fhéinfhostaíocht

source: You can register with Revenue as a self-employed sole trader online
ga: Is féidir leat clárú leis na Coimisinéirí Ioncaim mar thrádálaí aonair féinfhostaithe ar líne

source: Certain people can only register on paper using Form TR1 - Tax Registration form for Sole Traders, Trusts and Partnerships (pdf)
ga: Féadann daoine áirithe clárú ar pháipéar amháin ach úsáid a bhaint as Foirm TR1 - Foirm Chláraithe Cánach le haghaidh Trádálaithe Aonair, Iontaobhas agus Comhpháirtíochtaí (pdf)

source: When you register for self-assessment with Revenue you will automatically become registered for PRSI purposes with the Department of Social Protection
ga: Nuair a chláraíonn tú le haghaidh féinmheasúnú leis na Coimisinéirí Ioncaim, clárófar go huathoibríoch thú le haghaidh cuspóirí ÁSPC leis an Roinn Coimirce Sóisialaí

source: Revenue’s online service can also be used to register for employers' PAYE and PRSI and VAT, if you need to do so at this stage
ga: Ina theannta sin, is féidir seirbhís ar líne na gCoimisinéirí Ioncaim a úsáid le clárú le haghaidh ÍMAT agus ÁSPC agus CBL fostóra, más gá duit déanamh amhlaidh ag an bpointe seo

source: Lo-call telephone numbers for Revenue regional offices are available on Revenue's website
ga: Tá uimhreacha gutháin íosghlao le haghaidh oifigí réigiúnacha na gCoimisinéirí Ioncaim le fáil ar láithreán Gréasáin na gCoimisinéirí Ioncaim

source: You can also get contact details for offices in your region
ga: Is féidir leat sonraí teagmhála le haghaidh oifigí i do réigiún a fháil freisin
